-- ALTER DATABASE ticket SET lc_monetary = 'ru_RU.UTF-8'; -- Не работает

CREATE TABLE IF NOT EXISTS tariffs (
    tariff_id SERIAL PRIMARY KEY,
    price MONEY,
    position VARCHAR(100),
    date TIMESTAMP DEFAULT NOW(),
    concert_id INTEGER REFERENCES concerts(concert_id)
);

INSERT INTO tariffs (price, position, date, concert_id) VALUES
    (2500.00, 'Танцпол', '2024-06-15 18:00:00', 1),
    (7500.00, 'VIP Ложа', '2024-06-15 18:00:00', 1),
    (1200.00, 'Входной билет', '2024-06-16 20:00:00', 2),
    (3500.00, 'Амфитеатр', '2024-06-20 19:30:00', 3),
    (15000.00, 'Backstage Pass', '2024-06-21 23:00:00', 4),
    (900.00, 'Балкон', '2024-06-22 18:30:00', 5),
    (4200.00, 'Партер', '2024-06-25 19:00:00', 6),
    (1800.00, 'Фан-зона', '2024-06-28 17:00:00', 7),
    (2200.00, 'Сектор B1', '2024-07-01 18:00:00', 8),
    (5500.00, 'Столик', '2024-07-03 21:00:00', 9);

SELECT * FROM tariffs;

--  tariff_id |   price    |    position    |        date         | concert_id
-- -----------+------------+----------------+---------------------+------------
--          1 |  $2,500.00 | Танцпол        | 2024-06-15 18:00:00 |          1
--          2 |  $7,500.00 | VIP Ложа       | 2024-06-15 18:00:00 |          1
--          3 |  $1,200.00 | Входной билет  | 2024-06-16 20:00:00 |          2
--          4 |  $3,500.00 | Амфитеатр      | 2024-06-20 19:30:00 |          3
--          5 | $15,000.00 | Backstage Pass | 2024-06-21 23:00:00 |          4
--          6 |    $900.00 | Балкон         | 2024-06-22 18:30:00 |          5
--          7 |  $4,200.00 | Партер         | 2024-06-25 19:00:00 |          6
--          8 |  $1,800.00 | Фан-зона       | 2024-06-28 17:00:00 |          7
--          9 |  $2,200.00 | Сектор B1      | 2024-07-01 18:00:00 |          8
--         10 |  $5,500.00 | Столик         | 2024-07-03 21:00:00 |          9

-- ALTER DATABASE ticket SET lc_monetary = 'en_US.UTF-8'; -- Не работает
