CREATE TABLE IF NOT EXISTS transactions(
    transaction_id SERIAL PRIMARY KEY,
    from_user INT REFERENCES users(user_id)
    ON DELETE SET NULL
    ON UPDATE NO ACTION,
    to_tariff INT REFERENCES tariffs(tariff_id)
    ON DELETE SET NULL
    ON UPDATE NO ACTION,
    amount MONEY NOT NULL,
    created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

BEGIN; -- BEGIN TRANSACTION;

SELECT balance FROM users WHERE user_id = 1 FOR UPDATE;

-- SAVEPOINT before_UPDATE;

UPDATE users 
SET balance = balance - (SELECT price FROM tariffs WHERE tariff_id = 1)
WHERE user_id = 1 
  AND balance >= (SELECT price FROM tariffs WHERE tariff_id = 1);

INSERT INTO tickets (user_id, tariff_id)
VALUES (1, 1);

INSERT INTO transactions (from_user, to_tariff, amount)
SELECT 1, 1, price 
FROM tariffs 
WHERE tariff_id = 1;

-- ROLLBACK TO SAVEPOINT before_UPDATE;

COMMIT;


SELECT * FROM users;

SELECT * FROM tickets;

SELECT * FROM transactions;





 tariff_id |   price
-----------+------------
         1 |  $2,500.00
         2 |  $7,500.00
         3 |  $1,200.00
         4 |  $3,500.00
         5 | $15,000.00
         6 |    $900.00
         7 |  $4,200.00
         8 |  $1,800.00
         9 |  $2,200.00
        10 |  $5,500.00


--BEFORE

 user_id |       name       | age | birthdate  |    phone     |    balance
---------+------------------+-----+------------+--------------+---------------
       1 | Алексей Иванов   |  25 | 1999-05-15 | +79001112233 | $1,345,000.99
       2 | Мария Петрова    |  30 | 1994-08-22 | +79004445566 | $1,253,000.99
       3 | Дмитрий Соколов  |  22 | 2002-01-10 | +79007778899 |   $530,500.99
       4 | Анна Кузнецова   |  28 | 1996-11-30 | +79001234567 |   $548,520.99
       5 | Игорь Смирнов    |  35 | 1989-03-12 | +79009876543 |   $789,000.99
       6 | Елена Попова     |  27 | 1997-07-05 | +79005554433 |   $320,400.99
       7 | Сергей Васильев  |  40 | 1984-12-20 | +79002223344 |   $476,890.99
       8 | Ольга Новикова   |  24 | 2001-09-14 | +79006667788 | $7,203,200.99
       9 | Виктор Федоров   |  31 | 1993-02-28 | +79003332211 | $5,500,230.99
      10 | Наталья Морозова |  29 | 1995-06-18 | +79008889900 |   $960,390.99

-- AFTER

---------+------------------+-----+------------+--------------+---------------
       2 | Мария Петрова    |  30 | 1994-08-22 | +79004445566 | $1,253,000.99
       3 | Дмитрий Соколов  |  22 | 2002-01-10 | +79007778899 |   $530,500.99
       4 | Анна Кузнецова   |  28 | 1996-11-30 | +79001234567 |   $548,520.99
       5 | Игорь Смирнов    |  35 | 1989-03-12 | +79009876543 |   $789,000.99
       6 | Елена Попова     |  27 | 1997-07-05 | +79005554433 |   $320,400.99
       7 | Сергей Васильев  |  40 | 1984-12-20 | +79002223344 |   $476,890.99
       8 | Ольга Новикова   |  24 | 2001-09-14 | +79006667788 | $7,203,200.99
       9 | Виктор Федоров   |  31 | 1993-02-28 | +79003332211 | $5,500,230.99
      10 | Наталья Морозова |  29 | 1995-06-18 | +79008889900 |   $960,390.99
       1 | Алексей Иванов   |  25 | 1999-05-15 | +79001112233 | $1,342,500.99

--BEFORE

 ticket_id |        payment_time        | user_id | tariff_id
-----------+----------------------------+---------+-----------
         1 | 2024-05-01 10:30:00        |       1 |         1
         2 | 2024-05-01 12:15:00        |       2 |         2
         3 | 2024-05-02 09:00:00        |       3 |         3
         4 | 2024-05-03 15:45:00        |       4 |         4
         5 | 2024-05-05 20:20:00        |       5 |         5
         6 | 2024-05-06 11:10:00        |       6 |         6
         7 | 2024-05-07 14:00:00        |       7 |         7
         8 | 2024-05-08 16:30:00        |       8 |         8
         9 | 2024-05-09 19:00:00        |       9 |         9
        10 | 2026-03-16 11:39:34.252911 |      10 |        10

-- AFTER

 ticket_id |        payment_time        | user_id | tariff_id
-----------+----------------------------+---------+-----------
         1 | 2024-05-01 10:30:00        |       1 |         1
         2 | 2024-05-01 12:15:00        |       2 |         2
         3 | 2024-05-02 09:00:00        |       3 |         3
         4 | 2024-05-03 15:45:00        |       4 |         4
         5 | 2024-05-05 20:20:00        |       5 |         5
         6 | 2024-05-06 11:10:00        |       6 |         6
         7 | 2024-05-07 14:00:00        |       7 |         7
         8 | 2024-05-08 16:30:00        |       8 |         8
         9 | 2024-05-09 19:00:00        |       9 |         9
        10 | 2026-03-16 11:39:34.252911 |      10 |        10
        11 | 2026-03-16 12:09:22.599986 |       1 |         1

--BEFORE

 transaction_id | from_user | to_tariff | amount | created_at
----------------+-----------+-----------+--------+------------

-- AFTER

 transaction_id | from_user | to_tariff |  amount   |         created_at
----------------+-----------+-----------+-----------+----------------------------
              1 |         1 |         1 | $2,500.00 | 2026-03-16 12:09:22.599986

