CREATE TABLE IF NOT EXISTS users (
    user_id SERIAL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    age SMALLINT,
    birthdate DATE,
    phone VARCHAR(15),
    balance MONEY
);

INSERT INTO users (name, age, birthdate, phone, balance) VALUES
    ('Алексей Иванов', 25, '1999-05-15', '+79001112233', 1345000.99),
    ('Мария Петрова', 30, '1994-08-22', '+79004445566', 1253000.99),
    ('Дмитрий Соколов', 22, '2002-01-10', '+79007778899', 530500.99),
    ('Анна Кузнецова', 28, '1996-11-30', '+79001234567', 548520.99),
    ('Игорь Смирнов', 35, '1989-03-12', '+79009876543', 789000.99),
    ('Елена Попова', 27, '1997-07-05', '+79005554433', 320400.99),
    ('Сергей Васильев', 40, '1984-12-20', '+79002223344', 476890.99),
    ('Ольга Новикова', 24, '2001-09-14', '+79006667788', 7203200.99),
    ('Виктор Федоров', 31, '1993-02-28', '+79003332211', 5500230.99),
    ('Наталья Морозова', 29, '1995-06-18', '+79008889900', 960390.99);

SELECT * FROM users;

--  user_id |       name       | age | birthdate  |    phone     |    balance
-- ---------+------------------+-----+------------+--------------+---------------
--        1 | Алексей Иванов   |  25 | 1999-05-15 | +79001112233 | $1,345,000.99
--        2 | Мария Петрова    |  30 | 1994-08-22 | +79004445566 | $1,253,000.99
--        3 | Дмитрий Соколов  |  22 | 2002-01-10 | +79007778899 |   $530,500.99
--        4 | Анна Кузнецова   |  28 | 1996-11-30 | +79001234567 |   $548,520.99
--        5 | Игорь Смирнов    |  35 | 1989-03-12 | +79009876543 |   $789,000.99
--        6 | Елена Попова     |  27 | 1997-07-05 | +79005554433 |   $320,400.99
--        7 | Сергей Васильев  |  40 | 1984-12-20 | +79002223344 |   $476,890.99
--        8 | Ольга Новикова   |  24 | 2001-09-14 | +79006667788 | $7,203,200.99
--        9 | Виктор Федоров   |  31 | 1993-02-28 | +79003332211 | $5,500,230.99
--       10 | Наталья Морозова |  29 | 1995-06-18 | +79008889900 |   $960,390.99
