CREATE TABLE categories (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    category_id INTEGER, -- Поле для вложенных категорий (опционально)
    created_at TIMESTAMP WITH TIME ZONE DEFAULT CURRENT_TIMESTAMP,
    updated_at TIMESTAMP WITH TIME ZONE DEFAULT CURRENT_TIMESTAMP,
    deleted_at TIMESTAMP WITH TIME ZONE
);

INSERT INTO categories (name, category_id) VALUES 
-- Основные категории (ID 1, 2, 3 будут за ними)
('Компьютеры и комплектующие', NULL), -- id 1
('Бытовая техника', NULL),           -- id 2
('Спорт и отдых', NULL),             -- id 3

-- Подкатегории для Компьютеров (category_id = 1)
('Видеокарты', 1),                   -- id 4
('Мониторы', 1),                     -- id 5

-- Подкатегории для Бытовой техники (category_id = 2)
('Холодильники', 2),                 -- id 6
('Кофемашины', 2),                   -- id 7

-- Подкатегория для Спорта (category_id = 3)
('Тренажеры', 3);                    -- id 8



--  id |            name            | category_id |          created_at           |          updated_at           | deleted_at
-- ----+----------------------------+-------------+-------------------------------+-------------------------------+------------
--   1 | Компьютеры и комплектующие |             | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   2 | Бытовая техника            |             | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   3 | Спорт и отдых              |             | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   4 | Видеокарты                 |           1 | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   5 | Мониторы                   |           1 | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   6 | Холодильники               |           2 | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   7 | Кофемашины                 |           2 | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |
--   8 | Тренажеры                  |           3 | 2026-03-25 11:51:25.607807+05 | 2026-03-25 11:51:25.607807+05 |


